###################################################################

# Created by write_sdc on Tue Nov 10 23:21:40 2015

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports rst]
set_driving_cell -lib_cell INVX1 [get_ports {inst[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {inst[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_x[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_x[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_x[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_x[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_y[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_y[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_y[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_y[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_w[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_w[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_w[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_w[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_z[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_z[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_z[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {dpu_z[0]}]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0.1  [get_ports rst]
set_input_delay -clock clk  0.1  [get_ports {inst[1]}]
set_input_delay -clock clk  0.1  [get_ports {inst[0]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_x[3]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_x[2]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_x[1]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_x[0]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_y[3]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_y[2]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_y[1]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_y[0]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_w[3]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_w[2]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_w[1]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_w[0]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_z[3]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_z[2]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_z[1]}]
set_input_delay -clock clk  0.1  [get_ports {dpu_z[0]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_output[3]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_output[2]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_output[1]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_output[0]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_status[3]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_status[2]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_status[1]}]
set_output_delay -clock clk  0.1  [get_ports {dpu_status[0]}]
